app/controllers/links_controller.rb

  def index
    @links = Link.all
---
SELECT "links".* FROM "links"

  def show
    @link = Link.find(params[:id])
---
SELECT  "links".* FROM "links" WHERE "links"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @link = Link.new(link_params)

    respond_to do |format|
      if @link.save
---
INSERT INTO "links" ("created_at", "updated_at", "title") VALUES (?, ?, ?)  [["created_at", "2018-12-13 03:50:30.475396"], ["updated_at", "2018-12-13 03:50:30.475396"], ["title", "あああ"]]

  def update
    respond_to do |format|
      if @link.update(link_params)
---
UPDATE "links" SET "dates" = ?, "updated_at" = ? WHERE "links"."id" = ?  [["dates", 100], ["updated_at", "2018-12-18 06:06:41.088884"], ["id", 1]]

    def set_link
      @link = Link.find(params[:id])
---
SELECT  "links".* FROM "links" WHERE "links"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]